In [28]:
import sqlite3
import pandas as pd
import seaborn as sns 
import matplotlib as plt

In [29]:
con = sqlite3.connect('./data/Budget.db')
cur = con.cursor()

In [30]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [31]:
%sql sqlite:///./data/Budget.db

In [32]:
df = pd.read_csv('./data/R_STATEMENT_SAMPLE.csv')
df.to_sql('SAMPLE', con, if_exists= 'replace', index = False, method= 'multi')

/home/alice/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:2602: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [ ]:
%sql SELECT * FROM SAMPLE LIMIT 10

In [34]:
%sql pragma table_info(SAMPLE)

 * sqlite:///./data/Budget.db
Done.

[(0, 'Type', 'TEXT', 0, None, 0),
 (1, 'Product', 'TEXT', 0, None, 0),
 (2, 'Started Date', 'TEXT', 0, None, 0),
 (3, 'Completed Date', 'TEXT', 0, None, 0),
 (4, 'Description', 'TEXT', 0, None, 0),
 (5, 'Amount', 'REAL', 0, None, 0),
 (6, 'Fee', 'REAL', 0, None, 0),
 (7, 'Currency', 'TEXT', 0, None, 0),
 (8, 'State', 'TEXT', 0, None, 0),
 (9, 'Balance', 'REAL', 0, None, 0)]

In [35]:
%sql SELECT * FROM SAMPLE where "completed date" = 'None'

 * sqlite:///./data/Budget.db
Done.

[]

In [36]:
%sql

 * sqlite:///./data/Budget.db

### CREATE BASIC TABLE SETTINGS

In [37]:
%%sql 
PRAGMA foreign_keys = ON;
DROP TABLE IF EXISTS Event; 
DROP TABLE IF EXISTS Category;
DROP TABLE IF EXISTS Transactions;

CREATE TABLE Event(
    event_id INTEGER PRIMARY KEY AUTOINCREMENT,
    event_name TEXT NOT NULL,
    event_description TEXT,
    event_income NUMERIC,
    event_spent NUMERIC,
    event_balance NUMERIC,
    currency TEXT NOT NULL
);

CREATE TABLE Category(
    category_id INTEGER PRIMARY KEY AUTOINCREMENT,
    category_income NUMERIC NOT NULL,
    category_spent NUMERIC NOT NULL,
    category_balance NUMERIC NOT NULL,
    currency TEXT NOT NULL,
    cat_description TEXT
);

CREATE TABLE Accounts(
    account_id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    user TEXT,
    add_date TEXT
);


CREATE TABLE Transactions (
    transaction_id INTEGER PRIMARY KEY AUTOINCREMENT,
    date TEXT NOT NULL,
    description TEXT,
    income NUMERIC NOT NULL,
    spent NUMERIC NOT NULL,
    balance NUMERIC NOT NULL,
    currency TEXT NOT NULL,
    event_id INTEGER REFERENCES Event(event_id),
    category_id INTEGER REFERENCES Category(category_id),
    account_id INTEGER REFERENCES Accounts(account_id)
);

 * sqlite:///./data/Budget.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [38]:
%sql SELECT name FROM sqlite_master WHERE type = 'table'

 * sqlite:///./data/Budget.db
Done.

[('sqlite_sequence',),
 ('SAMPLE',),
 ('Event',),
 ('Category',),
 ('Accounts',),
 ('Transactions',)]

In [39]:
%sql pragma table_info(Transactions);

 * sqlite:///./data/Budget.db
Done.

[(0, 'transaction_id', 'INTEGER', 0, None, 1),
 (1, 'date', 'TEXT', 1, None, 0),
 (2, 'description', 'TEXT', 0, None, 0),
 (3, 'income', 'NUMERIC', 1, None, 0),
 (4, 'spent', 'NUMERIC', 1, None, 0),
 (5, 'balance', 'NUMERIC', 1, None, 0),
 (6, 'currency', 'TEXT', 1, None, 0),
 (7, 'event_id', 'INTEGER', 0, None, 0),
 (8, 'category_id', 'INTEGER', 0, None, 0),
 (9, 'account_id', 'INTEGER', 0, None, 0)]